knyghtryda/oepl-cc2630-firmware/firmware/main.c
// -----------------------------------------------------------------------------
//     CC2630 OEPL Tag Firmware
// -----------------------------------------------------------------------------
// Full OEPL tag: scan → checkin → block download → display
// Uses SEGGER RTT for debug output via J-Link.
// -----------------------------------------------------------------------------

#include <stdint.h>
#include <string.h>
#include "rtt.h"
#include "oepl_rf_cc2630.h"
#include "oepl_radio_cc2630.h"
#include "oepl_hw_abstraction_cc2630.h"
#include "drivers/oepl_display_driver_uc8159_600x448.h"
#include "splash.h"
#include "oepl_ota_cc2630.h"
#include "fault.h"

// TI driverlib
#include "sys_ctrl.h"

// PRCM registers (now from driverlib includes via sys_ctrl.h)
#include "prcm.h"
#include "hw_memmap.h"
#include "hw_prcm.h"

// RTC-timed sleep
#include "aon_rtc.h"

// Deep sleep: AON wakeup controller, event routing, interrupts, IO latch
#include "aon_wuc.h"
#include "aon_event.h"
#include "interrupt.h"
#include "hw_ints.h"
#include "aon_ioc.h"
#include "watchdog.h"

// Block buffers for image download (4100 bytes each: 4-byte header + 4096 data)
// bw_buf: cached B/W block (also used by OTA), red_buf: cached Red block
uint8_t bw_buf[BLOCK_XFER_BUFFER_SIZE];
static uint8_t red_buf[BLOCK_XFER_BUFFER_SIZE];
static int8_t bw_cache_id, red_cache_id;  // which block ID is cached (-1 = none)

// Warm boot detection: .noinit survives WFI return path (debug tag with JLink).
// Hardware reset source covers full standby wakeup (battery tag, no debugger).
#define WARMBOOT_MAGIC_A 0xDEE5BEEF
#define WARMBOOT_MAGIC_B 0x2116CAFE
__attribute__((section(".noinit"))) static volatile uint32_t warmboot_magic_a;
__attribute__((section(".noinit"))) static volatile uint32_t warmboot_magic_b;

static void delay_cycles(volatile uint32_t n)
{
    while (n--) {
        if ((n & 0xFFFF) == 0) oepl_hw_wdt_kick();
        __asm volatile ("nop");
    }
}

// AON RTC interrupt handler — wakes CPU from deep sleep (WFI).
// Overrides the weak alias to Default_Handler in startup_cc2630.c.
// Without this ISR and IntEnable(INT_AON_RTC_COMB), WFI hangs forever
// because the Cortex-M3 requires an NVIC-enabled interrupt to wake.
void AON_RTC_Handler(void)
{
    AONRTCEventClear(AON_RTC_CH0);
}

// Enter deep sleep with RTC-timed wakeup.
//
// Follows TI's SysCtrlStandby sequence: shuts down all power domains
// (RF, PERIPH, SERIAL, CPU, VIMS), gates deep-sleep clocks, requests uLDO,
// freezes IO, then enters standby via PRCMDeepSleep (SLEEPDEEP + WFI).
//
// Two outcomes:
//   1. WFI returns (JLink C_DEBUGEN blocks standby): loop continues
//   2. Full standby → reset: warm boot detected in main() via IOC latch
static void enter_sleep(uint32_t seconds)
{
    rtt_puts("SLEEP ");
    rtt_put_hex8((seconds >> 8) & 0xFF);
    rtt_put_hex8(seconds & 0xFF);
    rtt_puts("s\r\n");

    // Shut down RF core (main loop will re-init after wakeup)
    oepl_rf_shutdown();

    // Configure RTC wakeup (16.16 fixed-point format: seconds in upper 16 bits)
    AONRTCEnable();
    uint32_t now = AONRTCCurrentCompareValueGet();
    uint32_t target = now + (seconds << 16);
    AONRTCCompareValueSet(AON_RTC_CH0, target);
    AONRTCChannelEnable(AON_RTC_CH0);
    AONRTCEventClear(AON_RTC_CH0);

    // Configure combined event to include CH0 — drives INT_AON_RTC_COMB.
    // Without this, CH0 compare match never reaches NVIC, WFI never wakes.
    AONRTCCombinedEventConfig(AON_RTC_CH0);

    // Clear stale NVIC pending + enable RTC NVIC interrupt
    IntPendClear(INT_AON_RTC_COMB);
    IntEnable(INT_AON_RTC_COMB);

    // Save warm boot magic for WFI return path
    warmboot_magic_a = WARMBOOT_MAGIC_A;
    warmboot_magic_b = WARMBOOT_MAGIC_B;

    // Route RTC CH0 to MCU wakeup event (for PRCM standby wakeup)
    AONEventMcuWakeUpSet(AON_EVENT_MCU_WU0, AON_EVENT_RTC_CH0);

    // --- Standby configuration ---
    // SERIAL domain off crashes consistently (tests 6-8). Skip it.
    // PERIPH off + IOC freeze + PRCMDeepSleep = working standby.

    // Power off PERIPH domain (GPIO, Timer, UDMA)
    PRCMPowerDomainOff(PRCM_DOMAIN_PERIPH);

    // Freeze IO for warm boot detection
    AONIOCFreezeEnable();
    SysCtrlAonSync();

    rtt_puts("SLEEP WFI\r\n");

    // Watchdog stops in real standby. On the debugger WFI-return path the MCU
    // domain stays up, so give it the longest budget available (~47 min).
    WatchdogReloadSet(0xFFFFFFFF);
    oepl_hw_wdt_kick();

    // Enter deep sleep
    PRCMDeepSleep();

    oepl_hw_wdt_init();

    // --- If we reach here, WFI returned (JLink C_DEBUGEN prevents standby) ---

    AONIOCFreezeDisable();
    warmboot_magic_a = 0;
    warmboot_magic_b = 0;
    IntDisable(INT_AON_RTC_COMB);
    IntPendClear(INT_AON_RTC_COMB);
    AONRTCEventClear(AON_RTC_CH0);

    // Re-enable PERIPH domain for GPIO
    HWREG(PRCM_BASE + PRCM_O_PDCTL0PERIPH) = 1;
    for (volatile uint32_t i = 0; i < 500000; i++)
        if (HWREG(PRCM_BASE + PRCM_O_PDSTAT0PERIPH) & 1) break;
    HWREG(PRCM_BASE + PRCM_O_GPIOCLKGR) = 0x01;
    HWREG(PRCM_NONBUF_BASE + PRCM_O_CLKLOADCTL) = 0x01;
    for (volatile uint32_t i = 0; i < 500000; i++)
        if (HWREG(PRCM_BASE + PRCM_O_CLKLOADCTL) & 0x02) break;

    rtt_puts("WAKE\r\n");
}

static void print_mac_msb(const uint8_t *mac_lsb)
{
    // Print MAC in human-readable MSB-first order (reverse of wire order)
    for (int i = 7; i >= 0; i--) {
        rtt_put_hex8(mac_lsb[i]);
        if (i > 0) rtt_puts(":");
    }
}

static bool do_scan_and_checkin(struct AvailDataInfo *info)
{
    // Scan for AP
    rtt_puts("\r\n--- SCAN ---\r\n");
    int8_t ch = oepl_radio_scan_channels();
    if (ch < 0) {
        // Try direct checkin on all channels as fallback
        rtt_puts("Direct checkin...\r\n");
        for (uint8_t c = 0; c < OEPL_NUM_CHANNELS; c++) {
            rf_status_t rc = oepl_rf_set_channel(c);
            if (rc != RF_OK) continue;

            uint8_t ieee_ch = oepl_channel_map[c];
            radio_state_t *rst = oepl_radio_get_state();
            rst->current_channel = c;
            rst->current_ieee_ch = ieee_ch;
            rst->ap_found = true;
            memset(rst->ap_mac, 0xFF, 8);

            rtt_puts("Ch ");
            rtt_put_hex8(ieee_ch);
            rtt_puts(": ");
            if (oepl_radio_checkin(info)) return true;
        }
        return false;
    }

