knyghtryda/oepl-cc2630-firmware/firmware/main.c
    bw_cache_id = -1;
    red_cache_id = -1;

    // Full re-init display before each update (UC8159 requires fresh init before each DRF)
    rtt_puts("EPD wake...");
    uc8159_wake();
    rtt_puts("OK\r\n");

    // Open display for pixel data: DTM1 (cmd 0x10) in one CS frame
    oepl_hw_gpio_set(15, false);  // DC = command
    oepl_hw_spi_cs_assert();
    { uint8_t c = 0x10; oepl_hw_spi_send_raw(&c, 1); }
    oepl_hw_gpio_set(15, true);   // DC = data

    // Stream rows to display
    uint8_t bw_line[75];
    uint8_t red_line[75];
    uint8_t row_4bpp[300];

    for (uint16_t y = 0; y < height; y++) {
        // Abort early if AP clearly has nothing to serve
        if (dl_failed_blocks >= 3) {
            rtt_puts("\r\nABORT: AP not serving data\r\n");
            // Fill remaining rows with white
            memset(row_4bpp, 0x33, 300);  // 0x33 = white/white nibbles
            for (uint16_t remain = y; remain < height; remain++)
                oepl_hw_spi_send_raw(row_4bpp, 300);
            break;
        }

        uint32_t bw_offset = (uint32_t)y * row_bytes;

        // Get B/W line (failed blocks auto-fill white via ensure_bw_block)
        get_image_bytes(bw_offset, bw_line, row_bytes, info, false);

        // Get Red line (if 2bpp)
        if (has_red) {
            uint32_t red_offset = plane_size + (uint32_t)y * row_bytes;
            get_image_bytes(red_offset, red_line, row_bytes, info, true);
        } else {
            memset(red_line, 0, row_bytes);
        }

        // Convert to 4bpp (GD bit handles orientation)
        for (uint8_t x = 0; x < row_bytes; x++) {
            bwr_to_4bpp(bw_line[x], red_line[x], &row_4bpp[x * 4]);
        }

        // Send row to display
        oepl_hw_spi_send_raw(row_4bpp, 300);

        // Progress every 64 rows
        if ((y & 0x3F) == 0) {
            rtt_puts(".");
        }
    }

    oepl_hw_spi_cs_deassert();

    if (dl_failed_blocks > 0) {
        rtt_puts("\r\nDATA PARTIAL (");
        rtt_put_hex8(dl_failed_blocks);
        rtt_puts(" failed)\r\n");
    } else {
        rtt_puts("\r\nDATA OK\r\n");
    }

    // Refresh the panel, wait it out, power it off. XferComplete must not be
    // sent until this returns: transmitting during the refresh's peak current
    // draw lost the (then unacknowledged) frame on most cycles, and the AP
    // kept re-offering the image.
    uc8159_refresh_and_sleep();

    // Only send XferComplete if download was fully successful.
    // On partial failure, AP keeps data pending for retry next checkin.
    if (dl_failed_blocks == 0) {
        if (oepl_radio_send_xfer_complete()) {
            rtt_puts("XferComplete ACKed\r\n");
#ifdef DIAG_TELEMETRY
            diag_xfer = g_xfer_last_try;
#endif
        } else {
            rtt_puts("XferComplete NOT acked (AP will re-offer)\r\n");
#ifdef DIAG_TELEMETRY
            diag_xfer = g_xfer_tx_ok ? 0xF : 0xE;
#endif
        }
    } else {
        rtt_puts("Skipping XferComplete (retry next checkin)\r\n");
    }
#ifdef DIAG_TELEMETRY
    oepl_radio_set_diag_report(dl_failed_blocks, diag_xfer,
                               (uint8_t)(g_diag_requests > 255 ? 255 : g_diag_requests),
                               (uint8_t)(g_diag_rf_nok > 255 ? 255 : g_diag_rf_nok),
                               (uint8_t)(g_diag_rf_full > 255 ? 255 : g_diag_rf_full));
#endif

    return true;
}

int main(void)
{
    // --- Init RTT first (so we can debug early) ---
    rtt_init();

    // --- Check for warm boot (wakeup from standby) ---
    // Primary: IOC latch frozen (IOCLATCH_EN==0) — set by enter_sleep() before
    //   standby, synced via SysCtrlAonSync. TI-recommended detection method.
    // Fallback: SRAM magic in .noinit (survives WFI return + fault resets).
    bool ioc_frozen = (HWREG(AON_IOC_BASE + AON_IOC_O_IOCLATCH) & AON_IOC_IOCLATCH_EN) == 0;
    bool warm_boot = ioc_frozen ||
                     (warmboot_magic_a == WARMBOOT_MAGIC_A &&
                      warmboot_magic_b == WARMBOOT_MAGIC_B);
    warmboot_magic_a = 0;
    warmboot_magic_b = 0;

    // Post-standby adjustments
    if (ioc_frozen) {
        AONIOCFreezeDisable();
        SysCtrlAonUpdate();
        SysCtrlAdjustRechargeAfterPowerDown(0);
    }

    // --- Power up PERIPH domain (for GPIO) ---
    HWREG(PRCM_BASE + PRCM_O_PDCTL0PERIPH) = 1;
    for (volatile uint32_t i = 0; i < 500000; i++)
        if (HWREG(PRCM_BASE + PRCM_O_PDSTAT0PERIPH) & 1) break;

    // --- Enable GPIO clock ---
    HWREG(PRCM_BASE + PRCM_O_GPIOCLKGR) = 0x01;
    HWREG(PRCM_NONBUF_BASE + PRCM_O_CLKLOADCTL) = 0x01;
    for (volatile uint32_t i = 0; i < 500000; i++)
        if (HWREG(PRCM_BASE + PRCM_O_CLKLOADCTL) & 0x02) break;

    if (warm_boot) {
        delay_cycles(4800000);  // ~0.1s (shorter — no RTT client to wait for)
        rtt_puts("\r\n=== CC2630 OEPL Tag (WARM) ===\r\n");
    } else {
        delay_cycles(24000000);  // ~3 seconds (wait for RTT client)
        rtt_puts("\r\n=== CC2630 OEPL Tag ===\r\n");
    }

    // --- Boot message ---
    rtt_puts("RST=");
    rtt_put_hex8((uint8_t)SysCtrlResetSourceGet());
    rtt_puts(" IOC=");
    rtt_put_hex8(ioc_frozen ? 1 : 0);
    rtt_puts(" WARM=");
    rtt_put_hex8(warm_boot ? 1 : 0);
    rtt_puts("\r\n");

    // Watchdog: from here on anything that hangs for ~90s gets reset.
    oepl_hw_wdt_init();

    // A watchdog reset is a warm reset with no fault record: synthesise one
    // so it is reported like a crash (PC 0xDEADD006 = watchdog). Standby
    // wakeups also come through reset, so only a cold boot counts.
    if (!warm_boot && SysCtrlResetSourceGet() == RSTSRC_WARMRESET &&
        g_fault.magic != FAULT_MAGIC) {
        g_fault.pc = FAULT_PC_WATCHDOG;
        g_fault.lr = g_fault.sp = g_fault.cfsr = g_fault.bfar = 0;
        g_fault.magic = FAULT_MAGIC;
    }

    // Report a HardFault from the previous run (record written by the handler)
    bool had_fault = (g_fault.magic == FAULT_MAGIC);
    struct fault_record last_fault = {0};
    char fault_str[40] = "";
    if (had_fault) {
        last_fault = g_fault;
        g_fault.magic = 0;
        rtt_puts("LAST FAULT: PC="); rtt_put_hex32(last_fault.pc);
        rtt_puts(" LR="); rtt_put_hex32(last_fault.lr);
        rtt_puts(" SP="); rtt_put_hex32(last_fault.sp);
        rtt_puts(" CFSR="); rtt_put_hex32(last_fault.cfsr);
        rtt_puts(" BFAR="); rtt_put_hex32(last_fault.bfar);
        rtt_puts("\r\n");
        // Shown in red on the splash so a sealed tag's crash can be read off
        // the panel: "FAULT PC=xxxxxxxx CFSR=xxxxxxxx"
        static const char hexd[] = "0123456789ABCDEF";
        char *q = fault_str;
        memcpy(q, "FAULT PC=", 9); q += 9;
        for (int i = 28; i >= 0; i -= 4) *q++ = hexd[(last_fault.pc >> i) & 0xF];
        memcpy(q, " CFSR=", 6); q += 6;
        for (int i = 28; i >= 0; i -= 4) *q++ = hexd[(last_fault.cfsr >> i) & 0xF];
        *q = 0;
    }

    // Print MAC in human-readable form
    uint8_t mac[8];
    oepl_rf_get_mac(mac);
    rtt_puts("MAC: ");
    print_mac_msb(mac);
    rtt_puts("\r\n");

    // --- Initialize display ---
    uc8159_init();
    rtt_puts("Display init OK\r\n");

    // --- Initialize RF core ---
    rf_status_t rc = oepl_rf_init();
    if (rc != RF_OK) {
        rtt_puts("RF init FAILED: ");
        rtt_put_hex8(rc);
        rtt_puts("\r\n");
        goto idle;
    }
    rtt_puts("RF init OK\r\n");

    // --- Initialize OEPL radio protocol layer ---
    oepl_radio_init();

    // --- Splash screen only on cold boot ---
    if (!warm_boot) {
        rtt_puts("SPLASH: drawing\r\n");
        oepl_radio_set_wakeup_reason(WAKEUP_REASON_SPLASH);
        int8_t splash_ch = oepl_radio_scan_channels();
        int8_t temp_c;
        uint16_t bat_mv;
        oepl_hw_get_temperature(&temp_c);
        oepl_hw_get_voltage(&bat_mv);
        radio_state_t *rst = oepl_radio_get_state();
        splash_display(mac, bat_mv, temp_c, splash_ch >= 0, rst->current_ieee_ch,
                       had_fault ? fault_str : NULL);
        rtt_puts("SPLASH: done\r\n");
    } else {
        rtt_puts("WARM BOOT: skipping splash\r\n");
    }

