knyghtryda/oepl-cc2630-firmware/firmware/main.c
    // Tell the AP the first checkin after a crash is a fault reset (0xFE);
    // it shows up as wakeupReason in the AP tag DB, with the fault PC/status
    // encoded in that one checkin's battery/temperature/LQI fields.
    if (had_fault) {
        oepl_radio_set_wakeup_reason(WAKEUP_REASON_WDT_RESET);
        oepl_radio_set_fault_report(last_fault.pc, last_fault.cfsr);
    }

    // --- Main loop: periodic checkin + sleep ---
    // Cold boot: first 2 checkins use busy-wait (for JLink/RTT debugging).
    // After that, use deep standby (MCU VD powers off, RTC wakeup).
    // Warm boot: go directly to standby sleep (already proven working).
    uint32_t checkin_count = 0;
    bool use_sleep = warm_boot;
    while (1) {
        rtt_puts("\r\n=== Checkin #");
        rtt_put_hex32(checkin_count);
        rtt_puts(" ===\r\n");

        struct AvailDataInfo info;
        memset(&info, 0, sizeof(info));

        bool checkin_ok = do_scan_and_checkin(&info);

        if (checkin_ok) {
            rtt_puts("Checkin OK: dataType=");
            rtt_put_hex8(info.dataType);
            rtt_puts(" nextCheckIn=");
            rtt_put_hex8((info.nextCheckIn >> 8) & 0xFF);
            rtt_put_hex8(info.nextCheckIn & 0xFF);
            rtt_puts("\r\n");

            if (info.dataType == DATATYPE_FW_UPDATE) {
                if (oepl_ota_already_applied(info.dataVer)) {
                    rtt_puts("OTA: already applied, sending XferComplete\r\n");
                    oepl_radio_send_xfer_complete();
                } else {
                    rtt_puts("*** FW UPDATE ***\r\n");
                    oepl_ota_download_and_apply(&info);
                    // Returns only on failure — will retry next checkin
                    rtt_puts("FW update failed, retry later\r\n");
                }
            } else if (info.dataType != DATATYPE_NOUPDATE) {
                if (download_and_display(&info)) {
                    rtt_puts("*** IMAGE DISPLAYED ***\r\n");
                    oepl_radio_set_wakeup_reason(WAKEUP_REASON_TIMED);
                } else {
                    rtt_puts("Display failed\r\n");
                }
            } else {
                rtt_puts("No pending data\r\n");
                oepl_radio_set_wakeup_reason(WAKEUP_REASON_TIMED);
            }

            // AP sends nextCheckIn in minutes; convert to seconds
            uint32_t wait_sec = (uint32_t)info.nextCheckIn * 60;
            if (wait_sec < 30) wait_sec = 30;
            if (wait_sec > 3600) wait_sec = 3600;

            if (use_sleep) {
                enter_sleep(wait_sec);
            } else {
                rtt_puts("Sleep ");
                rtt_put_hex8((wait_sec >> 8) & 0xFF);
                rtt_put_hex8(wait_sec & 0xFF);
                rtt_puts("s (busy)\r\n");
                for (uint32_t s = 0; s < wait_sec; s++)
                    delay_cycles(8000000);
            }
        } else {
            if (use_sleep) {
                rtt_puts("Checkin failed, retry in 30s\r\n");
                enter_sleep(30);
            } else {
                rtt_puts("Checkin failed, retry in 30s (busy)\r\n");
                for (uint32_t s = 0; s < 30; s++)
                    delay_cycles(8000000);
            }
        }

        // After sleep, RF core was shut down — re-init before next checkin
        if (use_sleep) {
            bool rf_ok = false;
            for (uint8_t retry = 0; retry < 5; retry++) {
                if (retry > 0) {
                    rtt_puts("RF re-init retry ");
                    rtt_put_hex8(retry);
                    rtt_puts("\r\n");
                    delay_cycles(48000000);  // ~1s delay between retries
                }
                rc = oepl_rf_init();
                if (rc == RF_OK) {
                    rf_ok = true;
                    break;
                }
            }
            if (!rf_ok) {
                // All retries failed — system reset instead of dying
                rtt_puts("RF re-init FAILED x5, RESET\r\n");
                // Brief delay so RTT/UART output flushes
                delay_cycles(4800000);
                // Reset via ROM Hard-API
                typedef void (*reset_fn_t)(void);
                uint32_t *hapi_table = (uint32_t *)0x10000048;
                reset_fn_t rom_reset = (reset_fn_t)hapi_table[6];
                rom_reset();
                // Should not reach here
                while (1) __asm volatile("nop");
            }
            oepl_radio_init();
        }

        checkin_count++;
        if (checkin_count >= 2) {
            use_sleep = true;
        }
    }

idle:
    // Fatal error — wait 10 seconds then reset to try again
    rtt_puts("Fatal error, reset in 10s\r\n");
    for (uint8_t i = 0; i < 10; i++)
        delay_cycles(48000000);  // ~1s each
    {
        typedef void (*reset_fn_t)(void);
        uint32_t *hapi_table = (uint32_t *)0x10000048;
        reset_fn_t rom_reset = (reset_fn_t)hapi_table[6];
        rom_reset();
    }
    while (1) __asm volatile("nop");

    return 0;
}
